import random

card_values = {
    # Черви
    "2 ♥️": 2,
    "3 ♥️": 3,
    "4 ♥️": 4,
    "5 ♥️": 5,
    "6 ♥️": 6,
    "7 ♥️": 7,
    "8 ♥️": 8,
    "9 ♥️": 9,
    "10 ♥️": 10,
    "Валет ♥️": 2,
    "Дама ♥️": 3,
    "Король ♥️": 4,
    "Туз ♥️": 11,

    # Бубны
    "2 ♦️": 2,
    "3 ♦️": 3,
    "4 ♦️": 4,
    "5 ♦️": 5,
    "6 ♦️": 6,
    "7 ♦️": 7,
    "8 ♦️": 8,
    "9 ♦️": 9,
    "10 ♦️": 10,
    "Валет ♦️": 2,
    "Дама ♦️": 3,
    "Король ♦️": 4,
    "Туз ♦️": 11,

    # Трефы
    "2 ♣️": 2,
    "3 ♣️": 3,
    "4 ♣️": 4,
    "5 ♣️": 5,
    "6 ♣️": 6,
    "7 ♣️": 7,
    "8 ♣️": 8,
    "9 ♣️": 9,
    "10 ♣️": 10,
    "Валет ♣️": 2,
    "Дама ♣️": 3,
    "Король ♣️": 4,
    "Туз ♣️": 11,

    # Пики
    "2 ♠️": 2,
    "3 ♠️": 3,
    "4 ♠️": 4,
    "5 ♠️": 5,
    "6 ♠️": 6,
    "7 ♠️": 7,
    "8 ♠️": 8,
    "9 ♠️": 9,
    "10 ♠️": 10,
    "Валет ♠️": 2,
    "Дама ♠️": 3,
    "Король ♠️": 4,
    "Туз ♠️": 11
}

list_card = []
for i in card_values:
    list_card.append(i)


def get_card():
    random_key_card = random.choice(list_card)
    value_card = card_values[random_key_card]
    return random_key_card, value_card
